## Plan Result (635: prod_enterprise - TerraformPlanApply)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 132 to add, 0 to change, 18 to destroy.</code></pre>

* Create
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CNP-QA&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-DATAINGEST-PROD&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-DATAINGEST-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-DATAINGEST-SBOX&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-DATAINGEST-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-DATAINGEST-STG&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-DATAINGEST-STG&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-DEV&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_group.groups[&#34;Contributor Eligible&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_role_assignment.local_groups[&#34;Contributor Eligible&#34;]
* Replace
  * module.enterprise.module.bootstrap.azuread_group_member.platform_ops_in_non_prod_contributors[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group_member.platform_ops_in_non_prod_contributors[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group_member.platform_ops_in_non_prod_contributors[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group_member.platform_ops_in_non_prod_contributors[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group_member.platform_ops_in_non_prod_contributors[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group_member.platform_ops_in_non_prod_contributors[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group_member.platform_ops_in_non_prod_contributors[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group_member.platform_ops_in_non_prod_contributors[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor[&#34;SDS-Prod&#34;]




<details><summary>Change Result (Click me)</summary>

:warning: **The content is omitted as it is too long.** :warning:

```hcl

  # module.subscription["CP-COPILOT-BETA"].azuread_group.groups["Contributor Eligible"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Holds users eligible for Contributor access via access packages for CP-COPILOT-BETA subscription."
      + display_name                   = "DTS Contributors Eligible (sub:cp-copilot-beta)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_role_assignment.local_groups["Contributor Eligible"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor Eligible"
      + scope                            = "/subscriptions/21965399-c365-4539-9e1b-4d226d9eab74"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CRIME-ADO-POC"].azuread_group.groups["Contributor Eligible"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Holds users eligible for Contributor access via access packages for CRIME-ADO-POC subscription."
      + display_name                   = "DTS Contributors Eligible (sub:crime-ado-poc)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_role_assignment.local_groups["Contributor Eligible"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor Eligible"
      + scope                            = "/subscriptions/ef8dd153-3fba-47a4-be65-15775bcde240"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azuread_group.groups["Contributor Eligible"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Holds users eligible for Contributor access via access packages for DCD-AWS-Migration subscription."
      + display_name                   = "DTS Contributors Eligible (sub:dcd-aws-migration)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_role_assignment.local_groups["Contributor Eligible"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor Eligible"
      + scope                            = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFT-Sandbox"].azuread_group.groups["Contributor Eligible"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Holds users eligible for Contributor access via access packages for DCD-CFT-Sandbox subscription."
      + display_name                   = "DTS Contributors Eligible (sub:dcd-cft-sandbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["DCD-CFT-Sandbox"].azurerm_role_assignment.local_groups["Contributor Eligible"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor Eligible"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFT-VH-Pilot"].azuread_group.groups["Contributor Eligible"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Holds users eligible for Contributor access via access packages for DCD-CFT-VH-Pilot subscription."
      + display_name                   = "DTS Contributors Eligible (sub:dcd-cft-vh-pilot)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["DCD-CFT-VH-Pilot"].azurerm_role_assignment.local_groups["Contributor Eligible"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor Eligible"
      + scope                            = "/subscriptions/4bb049c8-33f3-4860-91b4-9ee45375cc18"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-DEMO"].azuread_group.groups["Contributor Eligible"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Holds users eligible for Contributor access via access packages for DCD-CFTAPPS-DEMO subscription."
      + display_name                   = "DTS Contributors Eligible (sub:dcd-cftapps-demo)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["DCD-CFTAPPS-DEMO"].azurerm_role_assignment.local_groups["Contributor Eligible"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor Eligible"
      + scope                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-DEV"].azuread_group.groups["Contributor Eligible"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Holds users eligible for Contributor access via access packages for DCD-CFTAPPS-DEV subscription."
      + display_name                   = "DTS Contributors Eligible (sub:dcd-cftapps-dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["DCD-CFTAPPS-DEV"].azurerm_role_assignment.local_groups["Contributor Eligible"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor Eligible"
      + scope                            = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-ITHC"].azuread_group.groups["Contributor Eligible"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Holds users eligible for Contributor access via access packages for DCD-CFTAPPS-ITHC subscription."
      + display_name                   = "DTS Contributors Eligible (sub:dcd-cftapps-ithc)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["DCD-CFTAPPS-ITHC"].azurerm_role_assignment.local_groups["Contributor Eligible"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor Eligible"
      + scope                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azuread_group.groups["Contributor Eligible"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                  

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

    = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_role_assignment.local_groups["Contributor Eligible"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor Eligible"
      + scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.data.azuread_group.pim_approvers will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "pim_approvers" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Azure PIM Approvers (CNP)"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = (known after apply)
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.enterprise.module.bootstrap.data.azuread_group.platform_ops will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "platform_ops" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Platform Operations"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = (known after apply)
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group_member.platform_ops_in_non_prod_contributors["CFT-NonProd"] must be replaced
-/+ resource "azuread_group_member" "platform_ops_in_non_prod_contributors" {
      ~ id               = "4f40f04b-1f5f-438b-a335-b44f31789403/member/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
      ~ member_object_id = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.enterprise.module.bootstrap.azuread_group_member.platform_ops_in_non_prod_contributors["CFT-Sandbox"] must be replaced
-/+ resource "azuread_group_member" "platform_ops_in_non_prod_contributors" {
      ~ id               = "ea2b1aaa-8fac-4ebb-a09f-c43004c9be92/member/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
      ~ member_object_id = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.enterprise.module.bootstrap.azuread_group_member.platform_ops_in_non_prod_contributors["Heritage-NonProd"] must be replaced
-/+ resource "azuread_group_member" "platform_ops_in_non_prod_contributors" {
      ~ id               = "60dfec23-80e2-41b6-8f26-7ffeadd6a4e9/member/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
      ~ member_object_id = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.enterprise.module.bootstrap.azuread_group_member.platform_ops_in_non_prod_contributors["Heritage-Sandbox"] must be replaced
-/+ resource "azuread_group_member" "platform_ops_in_non_prod_contributors" {
      ~ id               = "e3159325-35b6-4bcf-b4a5-b179e29e7131/member/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
      ~ member_object_id = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.enterprise.module.bootstrap.azuread_group_member.platform_ops_in_non_prod_contributors["Platform-NonProd"] must be replaced
-/+ resource "azuread_group_member" "platform_ops_in_non_prod_contributors" {
      ~ id               = "7ae98768-e2a8-4673-b8ff-3d343570be82/member/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
      ~ member_object_id = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.enterprise.module.bootstrap.azuread_group_member.platform_ops_in_non_prod_contributors["Platform-Sandbox"] must be replaced
-/+ resource "azuread_group_member" "platform_ops_in_non_prod_contributors" {
      ~ id               = "9f663da7-c14b-4d36-9374-16541768bae0/member/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
      ~ member_object_id = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.enterprise.module.bootstrap.azuread_group_member.platform_ops_in_non_prod_contributors["SDS-NonProd"] must be replaced
-/+ resource "azuread_group_member" "platform_ops_in_non_prod_contributors" {
      ~ id               = "334d4bcc-b332-472a-864b-c826fc861a00/member/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
      ~ member_object_id = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.enterprise.module.bootstrap.azuread_group_member.platform_ops_in_non_prod_contributors["SDS-Sandbox"] must be replaced
-/+ resource "azuread_group_member" "platform_ops_in_non_prod_contributors" {
      ~ id               = "c1325f94-4536-4860-ba46-c656241e6eca/member/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
      ~ member_object_id = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["CFT"] must be replaced
-/+ resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/providers/Microsoft.Management/managementGroups/CFT/providers/Microsoft.Authorization/roleAssignments/f7512d2f-a22f-b88a-09fb-032cbd54ae24" -> (known after apply)
      ~ name                                   = "f7512d2f-a22f-b88a-09fb-032cbd54ae24" -> (known after apply)
      ~ principal_id                           = "cfdbb1cc-e789-4d2c-b390-1d9ed77603d3" -> (known after apply) # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["CFT-Prod"] must be replaced
-/+ resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/providers/Microsoft.Management/managementGroups/CFT-Prod/providers/Microsoft.Authorization/roleAssignments/e0bc3653-b497-2ebf-ab7f-77c8178de7db" -> (known after apply)
      ~ name                                   = "e0bc3653-b497-2ebf-ab7f-77c8178de7db" -> (known after apply)
      ~ principal_id                           = "cfdbb1cc-e789-4d2c-b390-1d9ed77603d3" -> (known after apply) # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["Crime"] must be replaced
-/+ resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/providers/Microsoft.Management/managementGroups/Crime/providers/Microsoft.Authorization/roleAssignments/20b24b31-39bd-0976-6d86-cabff547f008" -> (known after apply)
      ~ name                                   = "20b24b31-39bd-0976-6d86-cabff547f008" -> (known after apply)
      ~ principal_id                           = "cfdbb1cc-e789-4d2c-b390-1d9ed77603d3" -> (known after apply) # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["HMCTS"] must be replaced
-/+ resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/providers/Microsoft.Management/managementGroups/HMCTS/providers/Microsoft.Authorization/roleAssignments/ee4c0267-d07c-b7ee-9c29-462967c50629" -> (known after apply)
      ~ name                                   = "ee4c0267-d07c-b7ee-9c29-462967c50629" -> (known after apply)
      ~ principal_id                           = "cfdbb1cc-e789-4d2c-b390-1d9ed77603d3" -> (known after apply) # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["Heritage"] must be replaced
-/+ resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/providers/Microsoft.Management/managementGroups/Heritage/providers/Microsoft.Authorization/roleAssignments/552f3570-659e-a670-f59c-bb3e921b18e1" -> (known after apply)
      ~ name                                   = "552f3570-659e-a670-f59c-bb3e921b18e1" -> (known after apply)
      ~ principal_id                           = "cfdbb1cc-e789-4d2c-b390-1d9ed77603d3" -> (known after apply) # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["Heritage-Prod"] must be replaced
-/+ resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/providers/Microsoft.Management/managementGroups/Heritage-Prod/providers/Microsoft.Authorization/roleAssignments/72c47d48-52b0-3128-80d5-ebfa0f525b9b" -> (known after apply)
      ~ name                                   = "72c47d48-52b0-3128-80d5-ebfa0f525b9b" -> (known after apply)
      ~ principal_id                           = "cfdbb1cc-e789-4d2c-b390-1d9ed77603d3" -> (known after apply) # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["Platform"] must be replaced
-/+ resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/providers/Microsoft.Management/managementGroups/Platform/providers/Microsoft.Authorization/roleAssignments/7f2cb870-5b29-cf77-3f58-fb58034f1813" -> (known after apply)
      ~ name                                   = "7f2cb870-5b29-cf77-3f58-fb58034f1813" -> (known after apply)
      ~ principal_id                           = "cfdbb1cc-e789-4d2c-b390-1d9ed77603d3" -> (known after apply) # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["Platform-Prod"] must be replaced
-/+ resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/providers/Microsoft.Management/managementGroups/Platform-Prod/providers/Microsoft.Authorization/roleAssignments/abe40035-4f18-b8d2-ab2a-918c7641e5a8" -> (known after apply)
      ~ name                                   = "abe40035-4f18-b8d2-ab2a-918c7641e5a8" -> (known after apply)
      ~ principal_id                           = "cfdbb1cc-e789-4d2c-b390-1d9ed77603d3" -> (known after apply) # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["SDS"] must be replaced
-/+ resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/providers/Microsoft.Management/managementGroups/SDS/providers/Microsoft.Authorization/roleAssignments/1195aec9-2f7c-d555-ceab-80ddc5a79ce9" -> (known after apply)
      ~ name                                   = "1195aec9-2f7c-d555-ceab-80ddc5a79ce9" -> (known after apply)
      ~ principal_id                           = "cfdbb1cc-e789-4d2c-b390-1d9ed77603d3" -> (known after apply) # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.pim_approvers_contributor["SDS-Prod"] must be replaced
-/+ resource "azurerm_role_assignment" "pim_approvers_contributor" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/providers/Microsoft.Management/managementGroups/SDS-Prod/providers/Microsoft.Authorization/roleAssignments/823b98a3-76c5-a079-3dd1-93641c2f4d11" -> (known after apply)
      ~ name                                   = "823b98a3-76c5-a079-3dd1-93641c2f4d11" -> (known after apply)
      ~ principal_id                           = "cfdbb1cc-e789-4d2c-b390-1d9ed77603d3" -> (known after apply) # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 132 to add, 0 to change, 18 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":140,"Program":"tfcmt","SHA1":"","Target":"635: prod_enterprise - TerraformPlanApply","Vars":{}} -->